IdeaRS.OpenModel.Connection.CheckResSummary
Check summary

IdeaRS.OpenModel.Connection.CheckResSummary.CheckValue
Check value

IdeaRS.OpenModel.Connection.CheckResSummary.CheckStatus
Status of check

IdeaRS.OpenModel.Connection.CheckResSummary.LoadCaseId
Id of Load Case

IdeaRS.OpenModel.Connection.CheckResSummary.Name
Name

IdeaRS.OpenModel.Connection.CheckResSummary.UnityCheckMessage
Detail message about overall check